/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memdel.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: qpfanner <qpfanner@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/04/05 12:18:09 by qpfanner          #+#    #+#             */
/*   Updated: 2019/04/05 12:20:30 by qpfanner         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Берет в качестве аргумента адрес в памяти, который нужно free и приводит указатель к NULL
*/
void    ft_memdel(void **ap)
{
    free (*ap);
    *ap = NULL;
}